{"class_name": "Model", "config": {"name": "model_33", "layers": [{"name": "input_33", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 143], "dtype": "float32", "sparse": false, "name": "input_33"}, "inbound_nodes": []}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_33", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_661", "class_name": "Concatenate", "config": {"name": "concatenate_661", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["input_33", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_661", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_662", "class_name": "Concatenate", "config": {"name": "concatenate_662", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_662", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_663", "class_name": "Concatenate", "config": {"name": "concatenate_663", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["input_33", 0, 0, {}]]]}, {"name": "concatenate_664", "class_name": "Concatenate", "config": {"name": "concatenate_664", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_33", 0, 0, {}], ["concatenate_663", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_664", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_665", "class_name": "Concatenate", "config": {"name": "concatenate_665", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_664", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_665", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_666", "class_name": "Concatenate", "config": {"name": "concatenate_666", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_666", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_667", "class_name": "Concatenate", "config": {"name": "concatenate_667", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_664", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_667", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_673", "class_name": "Concatenate", "config": {"name": "concatenate_673", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_673", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_667", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_674", "class_name": "Concatenate", "config": {"name": "concatenate_674", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_667", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_674", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_667", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "concatenate_668", "class_name": "Concatenate", "config": {"name": "concatenate_668", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_667", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_668", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "concatenate_675", "class_name": "Concatenate", "config": {"name": "concatenate_675", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_675", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_674", 0, 0, {}]]]}, {"name": "concatenate_669", "class_name": "Concatenate", "config": {"name": "concatenate_669", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_669", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "concatenate_676", "class_name": "Concatenate", "config": {"name": "concatenate_676", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_674", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_677", "class_name": "Concatenate", "config": {"name": "concatenate_677", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["concatenate_667", 0, 0, {}], ["concatenate_674", 0, 0, {}], ["concatenate_676", 0, 0, {}]]]}, {"name": "concatenate_670", "class_name": "Concatenate", "config": {"name": "concatenate_670", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_667", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_677", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_670", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "concatenate_678", "class_name": "Concatenate", "config": {"name": "concatenate_678", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_677", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_678", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_671", "class_name": "Concatenate", "config": {"name": "concatenate_671", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "concatenate_679", "class_name": "Concatenate", "config": {"name": "concatenate_679", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_671", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_670", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_679", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_672", "class_name": "Concatenate", "config": {"name": "concatenate_672", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_670", 0, 0, {}]]]}, {"name": "concatenate_680", "class_name": "Concatenate", "config": {"name": "concatenate_680", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_677", 0, 0, {}]]]}, {"name": "concatenate_681", "class_name": "Concatenate", "config": {"name": "concatenate_681", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_33", 0, 0, {}], ["concatenate_672", 0, 0, {}], ["concatenate_680", 0, 0, {}]]]}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_681", 0, 0, {}]]]}, {"name": "activation_33", "class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["dense_33", 0, 0, {}]]]}], "input_layers": [["input_33", 0, 0]], "output_layers": [["activation_33", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}