{"class_name": "Model", "config": {"name": "model_50", "layers": [{"name": "input_50", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 143], "dtype": "float32", "sparse": false, "name": "input_50"}, "inbound_nodes": []}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_50", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_998", "class_name": "Concatenate", "config": {"name": "concatenate_998", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["input_50", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_998", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_999", "class_name": "Concatenate", "config": {"name": "concatenate_999", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_999", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_1000", "class_name": "Concatenate", "config": {"name": "concatenate_1000", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["input_50", 0, 0, {}]]]}, {"name": "concatenate_1001", "class_name": "Concatenate", "config": {"name": "concatenate_1001", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_50", 0, 0, {}], ["concatenate_1000", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1001", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_1002", "class_name": "Concatenate", "config": {"name": "concatenate_1002", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1002", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1001", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_1003", "class_name": "Concatenate", "config": {"name": "concatenate_1003", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_1001", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1003", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_1008", "class_name": "Concatenate", "config": {"name": "concatenate_1008", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1008", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1003", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_1009", "class_name": "Concatenate", "config": {"name": "concatenate_1009", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_1003", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1009", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1003", 0, 0, {}]]]}, {"name": "concatenate_1010", "class_name": "Concatenate", "config": {"name": "concatenate_1010", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_1009", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1010", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "concatenate_1011", "class_name": "Concatenate", "config": {"name": "concatenate_1011", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1011", 0, 0, {}]]]}, {"name": "concatenate_1004", "class_name": "Concatenate", "config": {"name": "concatenate_1004", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1004", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1003", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "concatenate_1012", "class_name": "Concatenate", "config": {"name": "concatenate_1012", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_1009", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_1013", "class_name": "Concatenate", "config": {"name": "concatenate_1013", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["concatenate_1003", 0, 0, {}], ["concatenate_1009", 0, 0, {}], ["concatenate_1012", 0, 0, {}]]]}, {"name": "concatenate_1005", "class_name": "Concatenate", "config": {"name": "concatenate_1005", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_1003", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1013", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1005", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "concatenate_1014", "class_name": "Concatenate", "config": {"name": "concatenate_1014", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_1013", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1014", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_1006", "class_name": "Concatenate", "config": {"name": "concatenate_1006", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "concatenate_1015", "class_name": "Concatenate", "config": {"name": "concatenate_1015", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1006", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1005", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_1015", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": 