{"class_name": "Model", "config": {"name": "model_29", "layers": [{"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 143], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_580", "class_name": "Concatenate", "config": {"name": "concatenate_580", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["input_29", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_580", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_581", "class_name": "Concatenate", "config": {"name": "concatenate_581", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_581", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_582", "class_name": "Concatenate", "config": {"name": "concatenate_582", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["input_29", 0, 0, {}]]]}, {"name": "concatenate_583", "class_name": "Concatenate", "config": {"name": "concatenate_583", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_29", 0, 0, {}], ["concatenate_582", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_583", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_584", "class_name": "Concatenate", "config": {"name": "concatenate_584", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_584", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_583", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_585", "class_name": "Concatenate", "config": {"name": "concatenate_585", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_583", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_585", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_592", "class_name": "Concatenate", "config": {"name": "concatenate_592", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_585", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_592", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_593", "class_name": "Concatenate", "config": {"name": "concatenate_593", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_593", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_594", "class_name": "Concatenate", "config": {"name": "concatenate_594", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_585", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_585", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_594", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_586", "class_name": "Concatenate", "config": {"name": "concatenate_586", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_585", 0, 0, {}]]]}, {"name": "concatenate_595", "class_name": "Concatenate", "config": {"name": "concatenate_595", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_594", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_586", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_595", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_587", "class_name": "Concatenate", "config": {"name": "concatenate_587", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "concatenate_596", "class_name": "Concatenate", "config": {"name": "concatenate_596", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_587", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_596", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_588", "class_name": "Concatenate", "config": {"name": "concatenate_588", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_585", 0, 0, {}]]]}, {"name": "concatenate_597", "class_name": "Concatenate", "config": {"name": "concatenate_597", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_594", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_588", 0, 0, {}]]]}, {"name": "concatenate_598", "class_name": "Concatenate", "config": {"name": "concatenate_598", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["concatenate_585", 0, 0, {}], ["concatenate_594", 0, 0, {}], ["concatenate_597", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_598", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "concatenate_589", "class_name": "Concatenate", "config": {"name": "concatenate_589", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_588", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_589", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_590", "class_name": "Concatenate", "config": {"name": "concatenate_590", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "concatenate_599", "class_name": "Concatenate", "config": {"name": "concatenate_599", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_590", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_599", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_598", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_591", "class_name": "Concatenate", "config": {"name": "concatenate_591", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_588", 0, 0, {}]]]}, {"name": "concatenate_600", "class_name": "Concatenate", "config": {"name": "concatenate_600", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_598", 0, 0, {}]]]}, {"name": "concatenate_601", "class_name": "Concatenate", "config": {"name": "concatenate_601", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_29", 0, 0, {}], ["concatenate_591", 0, 0, {}], ["concatenate_600", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_601", 0, 0, {}]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["activation_29", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}