{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 143], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_211", "class_name": "Concatenate", "config": {"name": "concatenate_211", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["input_11", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_211", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_212", "class_name": "Concatenate", "config": {"name": "concatenate_212", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_212", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_213", "class_name": "Concatenate", "config": {"name": "concatenate_213", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["input_11", 0, 0, {}]]]}, {"name": "concatenate_214", "class_name": "Concatenate", "config": {"name": "concatenate_214", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_11", 0, 0, {}], ["concatenate_213", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_214", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_215", "class_name": "Concatenate", "config": {"name": "concatenate_215", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["concatenate_214", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_215", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_216", "class_name": "Concatenate", "config": {"name": "concatenate_216", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_216", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_217", "class_name": "Concatenate", "config": {"name": "concatenate_217", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["concatenate_214", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_217", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_222", "class_name": "Concatenate", "config": {"name": "concatenate_222", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["concatenate_217", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_222", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_223", "class_name": "Concatenate", "config": {"name": "concatenate_223", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_223", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_224", "class_name": "Concatenate", "config": {"name": "concatenate_224", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["concatenate_217", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_224", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_217", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_225", "class_name": "Concatenate", "config": {"name": "concatenate_225", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_9_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc4ca42_1_M_14_L_2", 0, 0, {}]]]}, {"name": "concatenate_218", "class_name": "Concatenate", "config": {"name": "concatenate_218", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_225", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_224", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_218", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_217", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_226", "class_name": "Concatenate", "config": {"name": "concatenate_226", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc4ca42_1_M_6_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc4ca42_1_M_10_L_2", 0, 0, {}], ["concatenate_224", 0, 0, {}]]]}, {"name": "concatenate_219", "class_name": "Concatenate", "config": {"name": "concatenate_219", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_2", 0, 0, {}], ["concatenate_217", 0, 0, {}]]]}, {"name": "concatenate_227", "class_name": "Concatenate", "config": {"name": "concatenate_227", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["concatenate_217", 0, 0, {}], ["concatenate_224", 0, 0, {}], ["concatenate_226", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_219", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_227", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_220", "class_name": "Concatenate", "config": {"name": "concatenate_220", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_9_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc4ca42_1_M_14_L_2", 0, 0, {}]]]}, {"name": "concatenate_228", "class_name": "Concatenate", "config": {"name": "concatenate_228", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_220", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_219", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_228", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_227", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc4ca42_1_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc4ca42_1_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, 