{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 143], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_61", "class_name": "Concatenate", "config": {"name": "concatenate_61", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_61", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_62", "class_name": "Concatenate", "config": {"name": "concatenate_62", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_62", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_63", "class_name": "Concatenate", "config": {"name": "concatenate_63", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "concatenate_64", "class_name": "Concatenate", "config": {"name": "concatenate_64", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_4", 0, 0, {}], ["concatenate_63", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_64", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_65", "class_name": "Concatenate", "config": {"name": "concatenate_65", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_65", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_64", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_66", "class_name": "Concatenate", "config": {"name": "concatenate_66", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_64", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_66", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_72", "class_name": "Concatenate", "config": {"name": "concatenate_72", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_72", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_66", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_73", "class_name": "Concatenate", "config": {"name": "concatenate_73", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_66", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_73", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_66", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "concatenate_67", "class_name": "Concatenate", "config": {"name": "concatenate_67", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_66", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_67", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "concatenate_74", "class_name": "Concatenate", "config": {"name": "concatenate_74", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_74", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_73", 0, 0, {}]]]}, {"name": "concatenate_68", "class_name": "Concatenate", "config": {"name": "concatenate_68", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_68", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "concatenate_75", "class_name": "Concatenate", "config": {"name": "concatenate_75", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_6_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc81e72_2_M_10_L_2", 0, 0, {}], ["concatenate_73", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_76", "class_name": "Concatenate", "config": {"name": "concatenate_76", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["concatenate_66", 0, 0, {}], ["concatenate_73", 0, 0, {}], ["concatenate_75", 0, 0, {}]]]}, {"name": "concatenate_69", "class_name": "Concatenate", "config": {"name": "concatenate_69", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_2_L_2", 0, 0, {}], ["concatenate_66", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_76", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_69", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_1", 0, 0, {}]]]}, {"name": "concatenate_77", "class_name": "Concatenate", "config": {"name": "concatenate_77", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_8_L_2", 0, 0, {}], ["concatenate_76", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_77", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_70", "class_name": "Concatenate", "config": {"name": "concatenate_70", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_9_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc81e72_2_M_14_L_2", 0, 0, {}]]]}, {"name": "concatenate_78", "class_name": "Concatenate", "config": {"name": "concatenate_78", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_1_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_70", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_69", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_78", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_6_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_10_L_1", 0, 0, {}]]]}, {"name": 