{"class_name": "Model", "config": {"name": "model_15", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 143], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_293", "class_name": "Concatenate", "config": {"name": "concatenate_293", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["input_15", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_293", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_294", "class_name": "Concatenate", "config": {"name": "concatenate_294", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_294", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_295", "class_name": "Concatenate", "config": {"name": "concatenate_295", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xa87ff6_4_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xa87ff6_4_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["input_15", 0, 0, {}]]]}, {"name": "concatenate_296", "class_name": "Concatenate", "config": {"name": "concatenate_296", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_15", 0, 0, {}], ["concatenate_295", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_296", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_297", "class_name": "Concatenate", "config": {"name": "concatenate_297", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["concatenate_296", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_297", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_298", "class_name": "Concatenate", "config": {"name": "concatenate_298", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_298", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_299", "class_name": "Concatenate", "config": {"name": "concatenate_299", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc4ca42_1_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc4ca42_1_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["concatenate_296", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_299", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "concatenate_305", "class_name": "Concatenate", "config": {"name": "concatenate_305", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["concatenate_299", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_305", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_306", "class_name": "Concatenate", "config": {"name": "concatenate_306", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_306", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_307", "class_name": "Concatenate", "config": {"name": "concatenate_307", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc9f0f8_8_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc9f0f8_8_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["concatenate_299", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_307", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_299", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_1", 0, 0, {}]]]}, {"name": "concatenate_308", "class_name": "Concatenate", "config": {"name": "concatenate_308", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["concatenate_307", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_308", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "concatenate_300", "class_name": "Concatenate", "config": {"name": "concatenate_300", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_9_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_14_L_2", 0, 0, {}]]]}, {"name": "concatenate_309", "class_name": "Concatenate", "config": {"name": "concatenate_309", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_300", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_299", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_309", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_1", 0, 0, {}]]]}, {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "concatenate_301", "class_name": "Concatenate", "config": {"name": "concatenate_301", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x45c48c_9_S_0xc4ca42_1_M_6_L_2", 0, 0, {}], ["BP_0x45c48c_9_S_0xc4ca42_1_M_10_L_2", 0, 0, {}], ["concatenate_299", 0, 0, {}]]]}, {"name": "concatenate_310", "class_name": "Concatenate", "config": {"name": "concatenate_310", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc20ad4_12_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc20ad4_12_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["concatenate_307", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_8_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_8_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_301", 0, 0, {}]]]}, {"name": "concatenate_311", "class_name": "Concatenate", "config": {"name": "concatenate_311", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["concatenate_299", 0, 0, {}], ["concatenate_307", 0, 0, {}], ["concatenate_310", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_8_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_8_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_8_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_311", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_8_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_8_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_8_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_0", 0, 0, {}]]]}, {"name": "concatenate_302", "class_name": "Concatenate", "config": {"name": "concatenate_302", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_8_L_2", 0, 0, {}], ["concatenate_301", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_1_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_1_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_302", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_4_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_1_L_1", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_1_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_1_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_1_L_2", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_1_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_1_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_1", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_7_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_7_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_1_L_2", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_0", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_7_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_7_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_7_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_1", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_7_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_7_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_7_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_2", "class_name": "Dropout", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_1", 0, 0, {}]]]}, {"name": "concatenate_303", "class_name": "Concatenate", "config": {"name": "concatenate_303", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc81e72_2_M_7_L_2", 0, 0, {}]]]}, {"name": "concatenate_312", "class_name": "Concatenate", "config": {"name": "concatenate_312", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_9_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_14_L_2", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_2_L_0", "class_name": "Dense", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_2_L_0", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_303", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_312", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_0", "class_name": "BatchNormalization", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_311", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_2_L_1", "class_name": "Activation", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_2_L_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_2_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_0", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_1", "class_name": "Dense", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0002500000118743628}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_0", 0, 0, {}]]]}, {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_2_L_2", "class_name": "Dropout", "config": {"name": "BP_0xc81e72_2_S_0xc81e72_2_M_2_L_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_2_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_1", 0, 0, {}]]]}, {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_2", "class_name": "Activation", "config": {"name": "BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_1", 0, 0, {}]]]}, {"name": "concatenate_304", "class_name": "Concatenate", "config": {"name": "concatenate_304", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0xc81e72_2_S_0xc81e72_2_M_1_L_2", 0, 0, {}], ["BP_0xc81e72_2_S_0xc81e72_2_M_2_L_2", 0, 0, {}], ["concatenate_301", 0, 0, {}]]]}, {"name": "concatenate_313", "class_name": "Concatenate", "config": {"name": "concatenate_313", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["BP_0x8f14e4_7_S_0xc4ca42_1_M_6_L_2", 0, 0, {}], ["BP_0x8f14e4_7_S_0xc4ca42_1_M_10_L_2", 0, 0, {}], ["concatenate_311", 0, 0, {}]]]}, {"name": "concatenate_314", "class_name": "Concatenate", "config": {"name": "concatenate_314", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_15", 0, 0, {}], ["concatenate_304", 0, 0, {}], ["concatenate_313", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, 